app/views/rounds/show.html.erb

SELECT "players".* FROM "players" INNER JOIN "player_rounds" ON "players"."id" = "player_rounds"."player_id" WHERE "player_rounds"."round_id" = $1  [["round_id", 32]]
---
<ul>
	<% @round.players.each do |player| %>