app/views/games/show.html.erb

SELECT "clues".* FROM "clues" WHERE "clues"."game_id" = $1  [["game_id", 1]]
---
	<ul id='clue_list'>
		<% @game.clues.reverse.each do |clue| %>