app/controllers/clues_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "clues" ("game_id", "text", "keyword", "pt_value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["game_id", 6], ["text", "cxcxcxcxcxc"], ["keyword", "cx"], ["pt_value", 1], ["created_at", "2016-03-03 22:32:04.559246"], ["updated_at", "2016-03-03 22:32:04.559246"]]
---
	def create
		@game = Game.find(params[:game_id])
		@clue = Clue.new(clue_params)
		if @clue.save

SELECT  "clues".* FROM "clues" WHERE "clues"."id" = $1 LIMIT 1  [["id", 60]]
---
	def edit
		# @game = Game.find(params[:game_id])
		@clue = Clue.find(params[:id])

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "clues".* FROM "clues" WHERE "clues"."id" = $1 LIMIT 1  [["id", 57]]
UPDATE "clues" SET "text" = $1, "keyword" = $2, "updated_at" = $3 WHERE "clues"."id" = $4  [["text", "WITH ERROR"], ["keyword", "now full"], ["updated_at", "2016-03-29 00:45:58.182700"], ["id", 61]]
---
	def update
		@game = Game.find(params[:game_id])
		@clue = Clue.find(params[:id])

		if @clue.update(clue_params)

SELECT  "clues".* FROM "clues" WHERE "clues"."id" = $1 LIMIT 1  [["id", 54]]
DELETE FROM "clues" WHERE "clues"."id" = $1  [["id", 54]]
---
	def destroy

		@clue = Clue.find(params[:id])
		@game = Game.find(@clue.game_id)
		@clue.destroy