app/controllers/games_controller.rb

	def create
		@game = Game.new(game_params)
		if @game.save
---
INSERT INTO "games" ("name", "theme", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "lockin"], ["theme", "lo"], ["user_id", 1], ["created_at", "2016-03-03 22:43:26.126649"], ["updated_at", "2016-03-03 22:43:26.126649"]]

	def sample_board
		@game = Game.find_by(id: params[:id])
		if @game.clues.empty?
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "clues" WHERE "clues"."game_id" = $1 LIMIT 1  [["game_id", 5]]
SELECT "clues".* FROM "clues" WHERE "clues"."game_id" = $1  [["game_id", 1]]