app/controllers/players_controller.rb

INSERT INTO "players" ("name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "bububa"], ["phone", "33412454"], ["created_at", "2016-03-30 19:42:04.972514"], ["updated_at", "2016-03-30 19:42:04.972514"]]
---
	def create
		@player = Player.new(player_params)
		# need to pass the id of the pertinent round
		@round = Round.find_by()
		if @player.save