app/controllers/rounds_controller.rb

	def create
		@game = Game.find(params[:game_id])
		@round = Round.new(url_ext: create_url, game_id: params[:game_id])
		if @round.save
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "rounds" ("url_ext", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url_ext", "KMUPDRSD"], ["game_id", 5], ["created_at", "2016-03-30 18:38:16.995321"], ["updated_at", "2016-03-30 18:38:16.995321"]]

	def show
		@round = Round.find(params[:id])
		@game = Game.find_by(id: @round.game_id)
---
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = $1 LIMIT 1  [["id", 31]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 5]]